app/views/chats/_chat.html.erb

INSERT INTO `chats` (`comment`, `contributor`, `created_at`, `updated_at`) VALUES ('こんにちは', '1', '2016-01-09 20:43:19', '2016-01-09 20:43:19')
---
    <strong class="u_name"><%= chat.useraccount.accountname %></strong>
    <span class="sub_time"><%= chat.created_at %></span><br>