app/controllers/chats_controller.rb

  def index
    return redirect_to '/1' if params[:id].nil?
    @comments = Chat.all.where(opponent: params[:id])
    @comment = Chat.new
    @accounts = Useraccount.all
---
SELECT `useraccounts`.* FROM `useraccounts`

  def create
    Chat.create(comment: comment_params[:comment], contributor: current_useraccount.id, opponent: params[:opponent])
---
INSERT INTO `chats` (`comment`, `contributor`, `created_at`, `updated_at`) VALUES ('こんにちは', '1', '2016-01-09 20:43:19', '2016-01-09 20:43:19')

  def destroy
    post = Chat.find(params[:id])
    Chat.find(params[:id]).destroy
---
SELECT  `chats`.* FROM `chats` WHERE `chats`.`id` = 3 LIMIT 1
DELETE FROM `chats` WHERE `chats`.`id` = 3