app/controllers/dms_controller.rb

SELECT `useraccounts`.* FROM `useraccounts`
SELECT  `useraccounts`.* FROM `useraccounts` WHERE `useraccounts`.`id` = 4  ORDER BY `useraccounts`.`id` ASC LIMIT 1
---
  def index
    @comments = Dm.where(opponent: params[:id]).where(contributor: current_useraccount.id)
    @comment = Dm.new
    @accounts = Useraccount.all
    @account = Useraccount.find(params[:id])